def calculate():
    price = float(input("Введіть ціну за 1 од. Товару"))
    H1 = int(input("Введіть кількість товару продану за 1 годину"))
    H2 = int(input("Введіть кількість товару продану за 2 годину"))
    H3 = int(input("Введіть кількість товару продану за 3 годину"))
    H4 = int(input("Введіть кількість товару продану за 4 годину"))
    H5 = int(input("Введіть кількість товару продану за 5 годину"))
    H6 = int(input("Введіть кількість товару продану за 6 годину"))
    H7 = int(input("Введіть кількість товару продану за 7 годину"))
    H8 = int(input("Введіть кількість товару продану за 8 годину"))



    E1 =  H1 * price
    E2 =  H2 * price
    E3 =  H3 * price
    E4 =  H4 * price
    E5 =  H5 * price
    E6 =  H6 * price
    E7 =  H7 * price
    E8 =  H8 * price

    total = price * (H1 + H2 + H3 + H4 + H5 + H6 + H7 + H8)
    SUMS = E1 + E2 + E3 + E4 + E5 + E6 + E7 + E8
    print("\n" + "╔" + "═" * 48 + "╗")
    print("║" + " " * 14 + "ПІДСУМОК ПРОДАЖІВ ЗА ЗМІНУ" + " " * 8 + "║")
    print("╠" + "═" * 48 + "╣")
    
    print("║" + " " * 3 + "Продажі по годинах:" + " " * 26 + "║")
    print(f"║   Година 1: {H1:3} шт. ➜ {E1:8.2f} грн" + " " * 13 + "║")
    print(f"║   Година 2: {H2:3} шт. ➜ {E2:8.2f} грн" + " " * 13 + "║")
    print(f"║   Година 3: {H3:3} шт. ➜ {E3:8.2f} грн" + " " * 13 + "║")
    print(f"║   Година 4: {H4:3} шт. ➜ {E4:8.2f} грн" + " " * 13 + "║")
    print(f"║   Година 5: {H5:3} шт. ➜ {E5:8.2f} грн" + " " * 13 + "║")
    print(f"║   Година 6: {H6:3} шт. ➜ {E6:8.2f} грн" + " " * 13 + "║")
    print(f"║   Година 7: {H7:3} шт. ➜ {E7:8.2f} грн" + " " * 13 + "║")
    print(f"║   Година 8: {H8:3} шт. ➜ {E8:8.2f} грн" + " " * 13 + "║")


    print("╠" + "═" * 48 + "╣")
    print("║" + " " * 3 + "ЗАГАЛЬНІ ПОКАЗНИКИ:" + " " * 26 + "║")
    print(f"║   Всього продано: {SUMS:4} шт." + " " * 20 + "║")
    print(f"║   Загальна вартість: {total:8.2f} грн" + " " * 14 + "║") 
    print("╚" + "═" * 48 + "╝")

calculate()
